import { ProductDTO } from "../types/DTO";


export const products: ProductDTO[] = [
	{
		id: 1,
		name: "ASUS X540LA 90NB0B01-M21330 i3 5005U/4/500/WiFi/BT/Win10/15.6 /1.75 кг",
		categoryId: 1,
		price: 1300,
		description: "Этот ноутбук создан для тех, кто хочет получить надежное и производительное компьютерное устройство с наиболее востребованным функционалом. Данная модель полностью удовлетворяет данные требования. Диск большого объема предоставляет вам возможности для долговременного хранения необходимой виртуальной информации. Устройство оборудовано веб-камерой и микрофоном, благодаря которым вы сможете организовывать видеоконференции с партнерами по бизнесу и коллегами по работе.",
		images: ["https://c.dns-shop.ru/thumb/st4/fit/500/500/c2291289ab16199f783d44e82a151d20/471f65fb43aae59958e9a41e96aade7e329d6aa27b6fac77fa3205b79dc6553d.jpg"],
		count: 1,
		features: {
			"Производитель": "Asus",
			"Модель": "ASUS VivoBook X540LA-DM1289",
			"Год релиза": "2019",
			"Тип оборудования": "Легкий ноутбук, Ноутбук для работы",
			"Цвет верхней крышки": "черный",
			"Материал корпуса": "пластик",
			"Тип оперативной памяти": "DDR3L",
			"Размер оперативной памяти": "4 Гб",
			"Модель процессора": "Core i3 5005U",
		}
	},
	{
		id: 2,
		name: "6.1\" Смартфон Apple iPhone 11 128 ГБ черный",
		categoryId: 2,
		price: 49990,
		description: "Корпус смартфона Apple iPhone 11 с диагональю 6.1\" выполнен из металла и украшен стеклянной панелью. Черный цвет устройства притягивает, что наряду с зеркальным блеском стекла создает весьма гармоничный дизайн. Защита по стандарту IP68 позволяет погружать устройство даже на глубину до 2 м на время до 30 мин. В арсенале аппарата 128 ГБ, что снимает всяческие ограничения с пользователя касательно съемки и сохранения различной цифровой информации. В основе устройства лежит процессор A13 Bionic с шестиядерной конфигурацией и работой на частоте 2.65 ГГц.В сочетании с 4 ГБ оперативного модуля вы получаете безграничные возможности плавного и высокоскоростного доступа к любым приложениям.Особенность Apple iPhone 11 состоит в поддержке функций универсального доступа, что обеспечивает эффективное пользование устройством людьми с ограниченными возможностями.Для длительной автономной работы модель использует аккумулятор емкостью 3110 мА·ч.Система камер 12+12 Мп, сочетающая в себе широкоугольную и сверхширокоугольную камеры, обладает широким набором возможностей.",
		images: [
			"https://c.dns-shop.ru/thumb/st4/fit/500/500/3bdbfd44f8855b32cbe27195d99cf40c/e46531f9972a05f1300d180268380f672dedbee2bddd2a610b661b71850dd4ca.jpg",
			"https://static-sl.insales.ru/images/products/1/1460/367134132/3.png",
			"https://c.dns-shop.ru/thumb/st1/fit/500/500/2bc862603db4547de1670801c203785a/bf4d2c3fb59bbaf7690900d1d2fa9807fd397bb0881ce2d17152dd9050adb8f1.jpg"
		],
		count: 1,
		features: {
			"Диагональ экрана (дюйм)": " 6.1\"",
			"Разрешение экрана": " 1792x828",
			"Плотность пикселей": " 326 ppi",
			"Частота обновления экрана": " 60 Гц",
			"Модель процессора": " Apple A13 Bionic",
		},
	},
	{
		id: 3,
		name: "10.4\" Планшет Huawei Matepad 64 ГБ 3G, LTE серый",
		categoryId: 4,
		price: 21999,
		description: "10.4\" Планшет Huawei Matepad 64 ГБ 3G, LTE производится в тонком корпусе с металлическим напылением и оснащается ярким безрамочным экраном с качеством 2K. Устройство рассчитано на универсальные задачи – от работы до развлечений – без ограничений пользователя по требованиям. Даже когда запущены единовременно несколько приложений, реакция 8-ядерного процессора Kirin 810, работающего на частоте 2.27 ГГц, вместе с 4 ГБ оперативной памяти остается быстрой и эффективной. Высокие стандарты Huawei поддерживает операционная система Android 10.x, кроме того, модель поддерживает Bluetooth, Wi-Fi, GPS. 10-дюймовый экран Huawei Matepad производится по технологии IPS и соответствует разрешению 2000x1200 пикселей. Качество видеороликов, игр и приложений порадует реалистичностью, скоростью отклика точек и насыщенной цветовой гамме. Встроенная память для загрузок достигает 64 ГБ, но ее можно расширить до 512 ГБ с помощью карты. Емкостный мультитач-экран с точным распознаванием прикосновений, две камеры, фронтальная и тыловая, по 8 Мп каждая, встроенные датчики и функции – все в планшете Matepad создано, чтобы пользование им доставило только приятные впечатления.",
		images: [
			"https://c.dns-shop.ru/thumb/st1/fit/500/500/bcdd1ab66c85531f68dca58913f6e25b/3a9abed69d7fa290bdd7e44b3a9e0e2fffcb43f58963ae7db23698bf9dada8bb.jpg",
			"https://c.dns-shop.ru/thumb/st1/fit/wm/2000/2000/f8bbd4b978bf36009cc929b5d45da312/cb1eaca598e1d378b23b33c8ed61f8d294d23579fac4a2f40ccfb140cece621c.jpg",
		],
		count: 0,
	},

	{
		id: 4,
		name: "ASUS X540LA 40NB0B03 intel core i5",
		categoryId: 1,
		price: 16390,
		description: "Этот ноутбук создан для тех, кто хочет получить надежное и производительное компьютерное устройство с наиболее востребованным функционалом. Данная модель полностью удовлетворяет данные требования. Диск большого объема предоставляет вам возможности для долговременного хранения необходимой виртуальной информации. Устройство оборудовано веб-камерой и микрофоном, благодаря которым вы сможете организовывать видеоконференции с партнерами по бизнесу и коллегами по работе.",
		images: [
			"https://c.dns-shop.ru/thumb/st4/fit/500/500/c2291289ab16199f783d44e82a151d20/471f65fb43aae59958e9a41e96aade7e329d6aa27b6fac77fa3205b79dc6553d.jpg"
		],
		count: 1,
		features: {
			"Производитель": "Asus",
			"Модель": "ASUS VivoBook X540LA-DM1289",
			"Размер оперативной памяти": "4 Гб",
			"Модель процессора": "Core i5",
		}
	},
	{
		id: 5,
		name: "Apple iPhone 11 черный",
		categoryId: 2,
		price: 45990,
		description: "Корпус смартфона Apple iPhone 11 с диагональю 6.1\" выполнен из металла и украшен стеклянной панелью. Черный цвет устройства притягивает, что наряду с зеркальным блеском стекла создает весьма гармоничный дизайн. Защита по стандарту IP68 позволяет погружать устройство даже на глубину до 2 м на время до 30 мин. В арсенале аппарата 128 ГБ, что снимает всяческие ограничения с пользователя касательно съемки и сохранения различной цифровой информации. В основе устройства лежит процессор A13 Bionic с шестиядерной конфигурацией и работой на частоте 2.65 ГГц.В сочетании с 4 ГБ оперативного модуля вы получаете безграничные возможности плавного и высокоскоростного доступа к любым приложениям.Особенность Apple iPhone 11 состоит в поддержке функций универсального доступа, что обеспечивает эффективное пользование устройством людьми с ограниченными возможностями.Для длительной автономной работы модель использует аккумулятор емкостью 3110 мА·ч.Система камер 12+12 Мп, сочетающая в себе широкоугольную и сверхширокоугольную камеры, обладает широким набором возможностей.",
		images: [
			"https://c.dns-shop.ru/thumb/st1/fit/500/500/2bc862603db4547de1670801c203785a/bf4d2c3fb59bbaf7690900d1d2fa9807fd397bb0881ce2d17152dd9050adb8f1.jpg",
			"https://c.dns-shop.ru/thumb/st4/fit/500/500/3bdbfd44f8855b32cbe27195d99cf40c/e46531f9972a05f1300d180268380f672dedbee2bddd2a610b661b71850dd4ca.jpg",
			"https://static-sl.insales.ru/images/products/1/1460/367134132/3.png",
		],
		count: 0,
		features: {
			"Диагональ экрана (дюйм)": " 6.1\"",
			"Разрешение экрана": " 1792x828",
			"Плотность пикселей": " 326 ppi",
			"Частота обновления экрана": " 60 Гц",
			"Модель процессора": " Apple A13 Bionic",
		},
	},
	{
		id: 6,
		name: "Планшет Huawei Matepad",
		categoryId: 4,
		price: 210999,
		description: "10.4\" Планшет Huawei Matepad 64 ГБ 3G, LTE производится в тонком корпусе с металлическим напылением и оснащается ярким безрамочным экраном с качеством 2K. Устройство рассчитано на универсальные задачи – от работы до развлечений – без ограничений пользователя по требованиям. Даже когда запущены единовременно несколько приложений, реакция 8-ядерного процессора Kirin 810, работающего на частоте 2.27 ГГц, вместе с 4 ГБ оперативной памяти остается быстрой и эффективной. Высокие стандарты Huawei поддерживает операционная система Android 10.x, кроме того, модель поддерживает Bluetooth, Wi-Fi, GPS. 10-дюймовый экран Huawei Matepad производится по технологии IPS и соответствует разрешению 2000x1200 пикселей. Качество видеороликов, игр и приложений порадует реалистичностью, скоростью отклика точек и насыщенной цветовой гамме. Встроенная память для загрузок достигает 64 ГБ, но ее можно расширить до 512 ГБ с помощью карты. Емкостный мультитач-экран с точным распознаванием прикосновений, две камеры, фронтальная и тыловая, по 8 Мп каждая, встроенные датчики и функции – все в планшете Matepad создано, чтобы пользование им доставило только приятные впечатления.",
		images: [
			"https://c.dns-shop.ru/thumb/st1/fit/500/500/bcdd1ab66c85531f68dca58913f6e25b/3a9abed69d7fa290bdd7e44b3a9e0e2fffcb43f58963ae7db23698bf9dada8bb.jpg",
			"https://c.dns-shop.ru/thumb/st1/fit/wm/2000/2000/f8bbd4b978bf36009cc929b5d45da312/cb1eaca598e1d378b23b33c8ed61f8d294d23579fac4a2f40ccfb140cece621c.jpg",
		],
		count: 1,
	},
];